Revit 2024 API
LineSegment.EndPoint Property
 End point of the line segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public XYZ EndPoint { get; }
Visual Basic
Public ReadOnly Property EndPoint As XYZ
	Get
Visual C++
public:
property XYZ^ EndPoint {
	XYZ^ get ();
}
See Also
LineSegment Class
Autodesk.Revit.DB Namespace